niri_config.org
# -*- indent-tabs-mode: nil; coding: utf-8-unix; -*-
#+PROPERTY: header-args :noweb yes :eval yes :exports results :results value
#+TITLE: Niri Config.kdl

* Overview
#+BEGIN_SRC kdl :tangle ./config.kdl :noweb yes :results value
  // LAST BUILD / DEPLOY: <<timestamp()>>
  // ## NOTES  ###########################################################  
  // This config file has been created by emacs org babel. This was done
  // mostly as a learning experiment and to address the gaps that .kdl
  // files have such as use of variables or access to env. variables etc.
  //
  // To generate this file without automation do the following (these are
  // notes to myself as I will forget this since once the changes
  // become stable I doubt I will remember any of this:
  // 1) Open ~/.config/org/babel/niri_config/niri_config.org
  // 2) M-x org-babel-execute-buffer (This will evaluate all of the code
  // blocks that have been marked for evaluation and display the results
  // just below the code block. To evaluate any code block place the
  // cursor inside the code block and C-c C-c.
  // 3) While inside of the niri_config.org file M-x org-babel-tangle
  // This will produce the config.kdl file in the niri_config dir.
  // 4) Copy config.kdl to the niri directory.
  // 5) To run steps 1-4 fully automated M-x niri-build-and-deploy. The
  // live config.kdl will be copied to config.999, where 999 is a
  // sequencial number and also keep the last 5 copies for rollback.
  //
  // I am using the archcraft distro which uses pywal. Anytime a new theme
  // is generated it generates a new colors.sh file that is applied all
  // the basic shell apps. The niri_config.org babel imports this file
  // and applies the colors to the niri config where applicable. This is
  // experimental as there are not really many places to apply colors to
  // a wtm in general (e.g. border, background).
#+END_SRC

* Date/Timestamp of Last Update/Deployment
#+name: timestamp
#+begin_src python :results value
from datetime import datetime
return datetime.now().strftime("%Y-%m-%d %H:%M:%S")
#+end_src

#+RESULTS: timestamp
: 2025-08-09 19:19:56

* Target System
I have multiple systems (e.g. laptop, desktop, pi) that need different configurations mostly as
it relates to monitor, workspace and some limited customization if keybindings. Change the
return value to be either "lenovo", "dell", or "pi" based on the target system.
#+name: target-system
#+begin_src python :results value
  return "lenovo"
#+end_src

#+RESULTS: target-system
: lenovo

* Variables - Colors
I currently use archraft as my base distro which included pywal for themeing. This section
integrates the archcraft themeing approach by loading the colors.css file and applying
them in a few areas like focued / unfocused window ring / border.
#+name: theme-colors-json
#+begin_src python :results value
import json

theme = {}
with open("/home/username/.cache/wal/colors.sh", "r") as f:
    for line in f:
        line = line.strip()
        if line.startswith("#") or "=" not in line:
            continue
        if line.startswith("export"):
            line = line.replace("export", "", 1).strip()
        key, val = map(str.strip, line.split("=", 1))
        val = val.strip("'\"")
        theme[key] = val

return json.dumps(theme)
#+end_src

#+RESULTS: theme-colors-json
: {"wallpaper": "/home/username/Pictures/wallpapers/rubiks-cube.png", "background": "#1e1c1c", "foreground": "#dfd7c6", "cursor": "#dfd7c6", "color0": "#1e1c1c", "color1": "#948B77", "color2": "#A1967E", "color3": "#9D9882", "color4": "#A79C83", "color5": "#B5A98D", "color6": "#C8B999", "color7": "#dfd7c6", "color8": "#9c968a", "color9": "#948B77", "color10": "#A1967E", "color11": "#9D9882", "color12": "#A79C83", "color13": "#B5A98D", "color14": "#C8B999", "color15": "#dfd7c6", "FZF_DEFAULT_OPTS": "", "LS_COLORS": "${LS_COLORS}:su=30;41:ow=30;42:st=30;44:"}

#+name: colors-dict
#+begin_src python :var colors_raw=theme-colors-json :results value
  # [colors.normal]
  # black   = "${color0}"
  # red     = "${color1}"
  # green   = "${color2}"
  # yellow  = "${color3}"
  # blue    = "${color4}"
  # magenta = "${color5}"
  # cyan    = "${color6}"
  # white   = "${color7}"
  	
  # [colors.bright]
  # black   = "${color8}"
  # red     = "${color9}"
  # green   = "${color10}"
  # yellow  = "${color11}"
  # blue    = "${color12}"
  # magenta = "${color13}"
  # cyan    = "${color14}"
  # white   = "${color15}"

  # background = background
  # foreground = foreground

  import json  
  colors = json.loads(colors_raw)
  return colors
#+end_src

#+RESULTS: colors-dict
: {'wallpaper': '/home/username/Pictures/wallpapers/rubiks-cube.png', 'background': '#1e1c1c', 'foreground': '#dfd7c6', 'cursor': '#dfd7c6', 'color0': '#1e1c1c', 'color1': '#948B77', 'color2': '#A1967E', 'color3': '#9D9882', 'color4': '#A79C83', 'color5': '#B5A98D', 'color6': '#C8B999', 'color7': '#dfd7c6', 'color8': '#9c968a', 'color9': '#948B77', 'color10': '#A1967E', 'color11': '#9D9882', 'color12': '#A79C83', 'color13': '#B5A98D', 'color14': '#C8B999', 'color15': '#dfd7c6', 'FZF_DEFAULT_OPTS': '', 'LS_COLORS': '${LS_COLORS}:su=30;41:ow=30;42:st=30;44:'}

#+name: background
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["background"]
#+end_src

#+RESULTS: background
: #1e1c1c

#+name: foreground
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["foreground"]
#+end_src

#+RESULTS: foreground
: #dfd7c6

#+name: color0
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color0"]
#+end_src

#+RESULTS: color0
: #1e1c1c

#+name: color1
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color1"]
#+end_src

#+RESULTS: color1
: #948B77

#+name: color2
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color2"]
#+end_src

#+RESULTS: color2
: #A1967E

#+name: color3
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color3"]
#+end_src

#+RESULTS: color3
: #9D9882

#+name: color4
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color4"]
#+end_src

#+RESULTS: color4
: #A79C83

#+name: color5
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color5"]
#+end_src

#+RESULTS: color5
: #B5A98D

#+name: color6
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color6"]
#+end_src

#+RESULTS: color6
: #C8B999

#+name: color7
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color7"]
#+end_src

#+RESULTS: color7
: #dfd7c6

#+name: color8
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color8"]
#+end_src

#+RESULTS: color8
: #9c968a

#+name: color9
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color9"]
#+end_src

#+RESULTS: color9
: #948B77

#+name: color10
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color10"]
#+end_src

#+RESULTS: color10
: #A1967E

#+name: color11
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color11"]
#+end_src

#+RESULTS: color11
: #9D9882

#+name: color12
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color12"]
#+end_src

#+RESULTS: color12
: #A79C83

#+name: color13
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color13"]
#+end_src

#+RESULTS: color13
: #B5A98D

#+name: color14
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color14"]
#+end_src

#+RESULTS: color14
: #C8B999

#+name: color15
#+begin_src python :var colors_raw=theme-colors-json :results value
import json
colors = json.loads(colors_raw)
return colors["color15"]
#+end_src

#+RESULTS: color15
: #dfd7c6

* Variables - Paths
All shared niri variables are set in this section. This overcomes the limitation that .kdl
has in using variables. Other ways to work around this in niri is to place most logic
in shell scripts which simplifies constructing commands.
#+NAME: niri_scripts
#+BEGIN_SRC python :results value
  return "~/.config/niri/scripts"
#+END_SRC

#+RESULTS: niri_scripts
: ~/.config/niri/scripts

#+NAME: niri_toolkit
#+BEGIN_SRC python :results value
  return "~/projects/niri_toolkit"
#+END_SRC

#+RESULTS: niri_toolkit
: ~/projects/niri_toolkit

#+NAME: screenshot_path
#+BEGIN_SRC python :results value
  return "~/Pictures/screenshots"
#+END_SRC

#+RESULTS: screenshot_path
: ~/Pictures/screenshots

#+NAME: screenshot_file
#+BEGIN_SRC python :results value
  return "Screenshot-from-%Y-%m-%d-%H-%M-%S.png"  
#+END_SRC

#+RESULTS: screenshot_file
: Screenshot-from-%Y-%m-%d-%H-%M-%S.png

