niri_config.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-08-06 Wed 13:08 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Niri Config.kdl</title>
<meta name="author" content="Mike Burns" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Niri Config.kdl</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org79c0315">1. Overview</a></li>
<li><a href="#orgc886827">2. Date/Timestamp of Last Update/Deployment</a></li>
<li><a href="#org8b206e0">3. Target System</a></li>
<li><a href="#org3608e59">4. Variables - Colors</a></li>
<li><a href="#org53a3624">5. Variables - Paths</a></li>
<li><a href="#org2ed4cef">6. Variables - Apps &amp; Scripts</a></li>
<li><a href="#orgfe1b951">7. Environment</a></li>
<li><a href="#orgc3adad1">8. Inputs</a></li>
<li><a href="#org2bac097">9. Outputs</a></li>
<li><a href="#org6f9f76b">10. Startup Apps</a></li>
<li><a href="#org3877c0c">11. Workspaces</a></li>
<li><a href="#org7e75c54">12. Other</a></li>
<li><a href="#orgc8ee916">13. Layout</a></li>
<li><a href="#org5bdf786">14. Window Rules</a></li>
<li><a href="#orga6572e1">15. Bindings</a></li>
</ul>
</div>
</div>
<div id="outline-container-org79c0315" class="outline-2">
<h2 id="org79c0315"><span class="section-number-2">1.</span> Overview</h2>
</div>
<div id="outline-container-orgc886827" class="outline-2">
<h2 id="orgc886827"><span class="section-number-2">2.</span> Date/Timestamp of Last Update/Deployment</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
2025-08-06 13:07:43
</pre>
</div>
</div>
<div id="outline-container-org8b206e0" class="outline-2">
<h2 id="org8b206e0"><span class="section-number-2">3.</span> Target System</h2>
<div class="outline-text-2" id="text-3">
<p>
I have multiple systems (e.g. laptop, desktop, pi) that need different configurations mostly as
it relates to monitor, workspace and some limited customization if keybindings. Change the
return value to be either "lenovo", "dell", or "pi" based on the target system.
</p>
<pre class="example">
lenovo
</pre>
</div>
</div>
<div id="outline-container-org3608e59" class="outline-2">
<h2 id="org3608e59"><span class="section-number-2">4.</span> Variables - Colors</h2>
<div class="outline-text-2" id="text-4">
<p>
I currently use archraft as my base distro which included pywal for themeing. This section
integrates the archcraft themeing approach by loading the colors.css file and applying
them in a few areas like focued / unfocused window ring / border.
</p>
<pre class="example">
{"wallpaper": "/home/username/Pictures/wallpapers/rubiks-cube.png", "background": "#1e1c1c", "foreground": "#dfd7c6", "cursor": "#dfd7c6", "color0": "#1e1c1c", "color1": "#948B77", "color2": "#A1967E", "color3": "#9D9882", "color4": "#A79C83", "color5": "#B5A98D", "color6": "#C8B999", "color7": "#dfd7c6", "color8": "#9c968a", "color9": "#948B77", "color10": "#A1967E", "color11": "#9D9882", "color12": "#A79C83", "color13": "#B5A98D", "color14": "#C8B999", "color15": "#dfd7c6", "FZF_DEFAULT_OPTS": "", "LS_COLORS": "${LS_COLORS}:su=30;41:ow=30;42:st=30;44:"}
</pre>


<pre class="example">
{'wallpaper': '/home/username/Pictures/wallpapers/rubiks-cube.png', 'background': '#1e1c1c', 'foreground': '#dfd7c6', 'cursor': '#dfd7c6', 'color0': '#1e1c1c', 'color1': '#948B77', 'color2': '#A1967E', 'color3': '#9D9882', 'color4': '#A79C83', 'color5': '#B5A98D', 'color6': '#C8B999', 'color7': '#dfd7c6', 'color8': '#9c968a', 'color9': '#948B77', 'color10': '#A1967E', 'color11': '#9D9882', 'color12': '#A79C83', 'color13': '#B5A98D', 'color14': '#C8B999', 'color15': '#dfd7c6', 'FZF_DEFAULT_OPTS': '', 'LS_COLORS': '${LS_COLORS}:su=30;41:ow=30;42:st=30;44:'}
</pre>


<pre class="example">
#1e1c1c
</pre>


<pre class="example">
#dfd7c6
</pre>


<pre class="example">
#1e1c1c
</pre>


<pre class="example">
#948B77
</pre>


<pre class="example">
#A1967E
</pre>


<pre class="example">
#9D9882
</pre>


<pre class="example">
#A79C83
</pre>


<pre class="example">
#B5A98D
</pre>


<pre class="example">
#C8B999
</pre>


<pre class="example">
#dfd7c6
</pre>


<pre class="example">
#9c968a
</pre>


<pre class="example">
#948B77
</pre>


<pre class="example">
#A1967E
</pre>


<pre class="example">
#9D9882
</pre>


<pre class="example">
#A79C83
</pre>


<pre class="example">
#B5A98D
</pre>


<pre class="example">
#C8B999
</pre>


<pre class="example">
#dfd7c6
</pre>
</div>
</div>
<div id="outline-container-org53a3624" class="outline-2">
<h2 id="org53a3624"><span class="section-number-2">5.</span> Variables - Paths</h2>
<div class="outline-text-2" id="text-5">
<p>
All shared niri variables are set in this section. This overcomes the limitation that .kdl
has in using variables. Other ways to work around this in niri is to place most logic
in shell scripts which simplifies constructing commands.
</p>
<pre class="example">
~/.config/niri/scripts
</pre>


<pre class="example">
~/projects/niri_toolkit
</pre>


<pre class="example">
~/Pictures/screenshots
</pre>


<pre class="example">
Screenshot-from-%Y-%m-%d-%H-%M-%S.png
</pre>
</div>
</div>
