niri_config.org
* Variables - Apps & Scripts
All my applications and shells scripts are set to variables here. This gives a little bit more
flexibility in constructing more complex statements mostly in the use of quoting. This also
give you the opportunity to execute some preprocessing logic if necessary.
#+NAME: bindings
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f'{_temp}/rofi_bindings'
  return f'"\\"{_temp}\\""'  
#+END_SRC

#+RESULTS: bindings
: "~/.config/niri/scripts/rofi_bindings"

#+NAME: launcher
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_launcher"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: launcher
: "~/.config/niri/scripts/rofi_launcher"

#+NAME: bluetooth
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_bluetooth"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: bluetooth
: "~/.config/niri/scripts/rofi_bluetooth"

#+NAME: power_menu
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_powermenu"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: power_menu
: "~/.config/niri/scripts/rofi_powermenu"

#+NAME: music
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_music"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: music
: "~/.config/niri/scripts/rofi_music"

#+NAME: network
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_network"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: network
: "~/.config/niri/scripts/rofi_network"

#+NAME: show_windows
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/rofi_showwindows"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: show_windows
: "~/.config/niri/scripts/rofi_showwindows"

#+NAME: term
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/alacritty"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: term
: "~/.config/niri/scripts/alacritty"

#+NAME: lock_screen
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/lockscreen"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: lock_screen
: "~/.config/niri/scripts/lockscreen"

#+NAME: scratchpad_put
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri_scratchpad"  
  cmd = [
      f'"{_temp}"',
      '"--action"', '"put"',
      '"--scratchpad_name"', '"scratchpad"'
  ]
  return " ".join(cmd)  
#+END_SRC

#+RESULTS: scratchpad_put
: "~/projects/niri_toolkit/niri_scratchpad" "--action" "put" "--scratchpad_name" "scratchpad"

#+NAME: scratchpad_get
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri_scratchpad"    
  cmd = [
      f'"{_temp}"',
      '"--action"', '"get"',
      '"--scratchpad_name"', '"scratchpad"'
  ]
  return " ".join(cmd)  
#+END_SRC

#+RESULTS: scratchpad_get
: "~/projects/niri_toolkit/niri_scratchpad" "--action" "get" "--scratchpad_name" "scratchpad"

#+NAME: emacs_prod
#+BEGIN_SRC python :results value
      cmd = [
          '"emacsclient"',
          '"-c"',
          '"-s"', '"emacs-prod"'
      ]
      return " ".join(cmd)  
#+END_SRC

#+RESULTS: emacs_prod
: "emacsclient" "-c" "-s" "emacs-prod"

#+NAME: emacs_dev
#+BEGIN_SRC python :results value
    cmd = [
        '"emacsclient"',
        '"-c"', 
        '"-s"', '"emacs-dev"'
    ]
    return " ".join(cmd)  
#+END_SRC

#+RESULTS: emacs_dev
: "emacsclient" "-c" "-s" "emacs-dev"

#+NAME: file_gui
#+BEGIN_SRC python
  return f'"\\"thunar\\""'
#+END_SRC

#+RESULTS: file_gui
: "thunar"


#+NAME: file_term
#+BEGIN_SRC python :results value
cmd = [
    '"sh"',
    '"-c"', '"kitty --detach yazi"'
]
return " ".join(cmd)
#+END_SRC

#+RESULTS: file_term
: "sh" "-c" "kitty --detach yazi"

#+NAME: browser
#+BEGIN_SRC python
  return f'"\\"vivaldi-snapshot\\""'
#+END_SRC

#+RESULTS: browser
: "vivaldi-snapshot"

#+NAME: notes
#+BEGIN_SRC python
  return f'"\\"pluma\\""'  
#+END_SRC

#+RESULTS: notes
: "pluma"

#+NAME: email_get
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-move-window.py"
  cmd = [
      f'"{_temp}"',
      '"--match"', '"mu4e"',
      '"--target"', '"m"',
      '"--target_id"', '"HDMI-A-2"',
      '"--focus"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: email_get
: "~/projects/niri_toolkit/niri-move-window.py" "--match" "mu4e" "--target" "m" "--target_id" "HDMI-A-2" "--focus"

#+NAME: email_put
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-move-window.py"
  cmd = [
      f'"{_temp}"',
      '"--match"', '"mu4e"',
      '"--target"', '"w"',
      '"--target_id"', '"messaging"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: email_put
: "~/projects/niri_toolkit/niri-move-window.py" "--match" "mu4e" "--target" "w" "--target_id" "messaging"

#+NAME: sms_get
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-move-window.py"
  cmd = [
      f'"{_temp}"',
      '"--match"', '"Messages"',
      '"--target"', '"m"',
      '"--target_id"', '"HDMI-A-2"',
      '"--focus"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: sms_get
: "~/projects/niri_toolkit/niri-move-window.py" "--match" "Messages" "--target" "m" "--target_id" "HDMI-A-2" "--focus"

#+NAME: sms_put
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-move-window.py"
  cmd = [
      f'"{_temp}"',
      '"--match"', '"Messages"',
      '"--target"', '"w"',
      '"--target_id"', '"messaging"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: sms_put
: "~/projects/niri_toolkit/niri-move-window.py" "--match" "Messages" "--target" "w" "--target_id" "messaging"

#+NAME: audio_raise_volume
#+BEGIN_SRC python :results value
  cmd = [
      '"wpctl"',
      '"set-volume"',
      '"@DEFAULT_AUDIO_SINK@"',
      '"0.1+"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: audio_raise_volume
: "wpctl" "set-volume" "@DEFAULT_AUDIO_SINK@" "0.1+"

#+NAME: audio_lower_volume
#+BEGIN_SRC python :results value
  cmd = [
      '"wpctl"',
      '"set-volume"',
      '"@DEFAULT_AUDIO_SINK@"',
      '"0.1-"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: audio_lower_volume
: "wpctl" "set-volume" "@DEFAULT_AUDIO_SINK@" "0.1-"

#+NAME: audio_mute
#+BEGIN_SRC python :results value
  cmd = [
      '"wpctl"',
      '"set-mute"',
      '"@DEFAULT_AUDIO_SINK@"',
      '"toggle"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: audio_mute
: "wpctl" "set-mute" "@DEFAULT_AUDIO_SINK@" "toggle"

#+NAME: audio_mic_mute
#+BEGIN_SRC python :results value
  cmd = [
      '"wpctl"',
      '"set-mute"',
      '"@DEFAULT_AUDIO_SOURCE@"',
      '"toggle"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: audio_mic_mute
: "wpctl" "set-mute" "@DEFAULT_AUDIO_SOURCE@" "toggle"


#+NAME: idle_lock
#+BEGIN_SRC python :results value
  cmd = [
      '"sh"',
      '"-c"',
      '"swayidle -w timeout 600 <<niri_scripts()>>/lockscreen"'
  ]
  return " ".join(cmd)
#+END_SRC

#+RESULTS: idle_lock
: "sh" "-c" "swayidle -w timeout 600 ~/.config/niri/scripts/lockscreen"

#+NAME: setup_theme
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/setup_theme"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: setup_theme
: "~/.config/niri/scripts/setup_theme"

#+NAME: wallpaper
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/wallpaper"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: wallpaper
: "~/.config/niri/scripts/wallpaper"

#+NAME: notifications
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/notifications"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: notifications
: "~/.config/niri/scripts/notifications"

#+NAME: status_bar
#+BEGIN_SRC python :var _temp=niri_scripts :results value
  _temp = f"{_temp}/statusbar"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: status_bar
: "~/.config/niri/scripts/statusbar"

#+NAME: spotify
#+BEGIN_SRC python
  return f'"\\"spotify\\""'      
#+END_SRC

#+RESULTS: spotify
: "spotify"

#+NAME: element
#+BEGIN_SRC python
  return f'"\\"element-desktop\\""'  
#+END_SRC

#+RESULTS: element
: "element-desktop"

#+NAME: sms
#+BEGIN_SRC python
  return f'"\\"googlemessages\\""'  
#+END_SRC

#+RESULTS: sms
: "googlemessages"

#+NAME: calendar
#+BEGIN_SRC python
  return f'"\\"google-calendar-nativefier-dark\\""'  
#+END_SRC

#+RESULTS: calendar
: "google-calendar-nativefier-dark"

#+NAME: discord
#+BEGIN_SRC python
  return f'"\\"vesktop\\""'  
#+END_SRC

#+RESULTS: discord
: "vesktop"

#+NAME: email
#+BEGIN_SRC python
  return f'"\\"geary\\""'  
#+END_SRC

#+RESULTS: email
: "geary"

#+NAME: xwayland
#+BEGIN_SRC python
  return f'"\\"xwayland-satellite\\" \\"--display 2\\""'  
#+END_SRC

#+RESULTS: xwayland
: "xwayland-satellite" "--display 2"

#+NAME: screenshot_viewer
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-screenshot-picker"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: screenshot_viewer
: "~/projects/niri_toolkit/niri-screenshot-picker"

#+NAME: screenshot_viewer_emacs
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-screenshot-picker-emacs"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: screenshot_viewer_emacs
: "~/projects/niri_toolkit/niri-screenshot-picker-emacs"

#+NAME: niri_hot_change
#+BEGIN_SRC python :var _temp=niri_toolkit :results value
  _temp = f"{_temp}/niri-hot-change"
  return f'"\\"{_temp}\\""'    
#+END_SRC

#+RESULTS: niri_hot_change
: "~/projects/niri_toolkit/niri-hot-change"

* Environment
This sets the niri environment variables. You can also pull environment variables in
externally if you need reference to them which is a limitation in .kdl.  Currently
I only need to set the DISPLAY variable for xwayland.
#+BEGIN_SRC kdl :tangle ./config.kdl
// ## ENVIRONMENT  ###########################################################  
  environment {
          DISPLAY ":1"
  }
#+END_SRC

