niri_config.html
<div id="outline-container-org2ed4cef" class="outline-2">
<h2 id="org2ed4cef"><span class="section-number-2">6.</span> Variables - Apps &amp; Scripts</h2>
<div class="outline-text-2" id="text-6">
<p>
All my applications and shells scripts are set to variables here. This gives a little bit more
flexibility in constructing more complex statements mostly in the use of quoting. This also
give you the opportunity to execute some preprocessing logic if necessary.
</p>
<pre class="example">
"~/.config/niri/scripts/rofi_bindings"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_launcher"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_bluetooth"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_powermenu"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_music"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_network"
</pre>


<pre class="example">
"~/.config/niri/scripts/rofi_showwindows"
</pre>


<pre class="example">
"~/.config/niri/scripts/alacritty"
</pre>


<pre class="example">
"~/.config/niri/scripts/lockscreen"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri_scratchpad" "--action" "put" "--scratchpad_name" "scratchpad"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri_scratchpad" "--action" "get" "--scratchpad_name" "scratchpad"
</pre>


<pre class="example">
"emacsclient" "-c" "-s" "emacs-prod"
</pre>


<pre class="example">
"emacsclient" "-c" "-s" "emacs-dev"
</pre>


<pre class="example">
"thunar"
</pre>



<pre class="example">
"sh" "-c" "kitty --detach yazi"
</pre>


<pre class="example">
"vivaldi-snapshot"
</pre>


<pre class="example">
"pluma"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-move-window.py" "--match" "mu4e" "--target" "m" "--target_id" "HDMI-A-2" "--focus"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-move-window.py" "--match" "mu4e" "--target" "w" "--target_id" "messaging"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-move-window.py" "--match" "Messages" "--target" "m" "--target_id" "HDMI-A-2" "--focus"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-move-window.py" "--match" "Messages" "--target" "w" "--target_id" "messaging"
</pre>


<pre class="example">
"wpctl" "set-volume" "@DEFAULT_AUDIO_SINK@" "0.1+"
</pre>


<pre class="example">
"wpctl" "set-volume" "@DEFAULT_AUDIO_SINK@" "0.1-"
</pre>


<pre class="example">
"wpctl" "set-mute" "@DEFAULT_AUDIO_SINK@" "toggle"
</pre>


<pre class="example">
"wpctl" "set-mute" "@DEFAULT_AUDIO_SOURCE@" "toggle"
</pre>



<pre class="example">
"sh" "-c" "swayidle -w timeout 600 ~/.config/niri/scripts/lockscreen"
</pre>


<pre class="example">
"~/.config/niri/scripts/setup_theme"
</pre>


<pre class="example">
"~/.config/niri/scripts/wallpaper"
</pre>


<pre class="example">
"~/.config/niri/scripts/notifications"
</pre>


<pre class="example">
"~/.config/niri/scripts/statusbar"
</pre>


<pre class="example">
"spotify"
</pre>


<pre class="example">
"element-desktop"
</pre>


<pre class="example">
"googlemessages"
</pre>


<pre class="example">
"google-calendar-nativefier-dark"
</pre>


<pre class="example">
"vesktop"
</pre>


<pre class="example">
"geary"
</pre>


<pre class="example">
"xwayland-satellite" "--display 2"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-screenshot-picker"
</pre>


<pre class="example">
"~/projects/niri_toolkit/niri-screenshot-picker-emacs"
</pre>
</div>
</div>
<div id="outline-container-orgfe1b951" class="outline-2">
<h2 id="orgfe1b951"><span class="section-number-2">7.</span> Environment</h2>
<div class="outline-text-2" id="text-7">
<p>
This sets the niri environment variables. You can also pull environment variables in
externally if you need reference to them which is a limitation in .kdl.  Currently
I only need to set the DISPLAY variable for xwayland.
</p>
</div>
</div>
