niri_config.org
* Inputs
This section defined inputs such as keyboard, mouse, pen etc. Focus follows mouse it
probably the most critical setting for my use so that when hovering a mouse over
a windows the focus also it set to the window being hovered. I have adopted this sam
behaviour in emacs since using tile managers.
#+BEGIN_SRC kdl :tangle ./config.kdl
// ## INPUT CONFIGURATION ####################################################  
  input {
          keyboard {
                  xkb {
                     // layout "us,ru"
                     // options "grp:win_space_toggle,compose:ralt,ctrl:nocaps"
                  }
                  numlock
          }

          touchpad {
                  // off
                  tap
                  // dwt
                  // dwtp
                  // drag false
                  // drag-lock
                  natural-scroll
                  // accel-speed 0.2
                  // accel-profile "flat"
                  // scroll-method "two-finger"
                  // disabled-on-external-mouse
          }

          mouse {
                  // off
                  natural-scroll
                  accel-speed -0.5
                  accel-profile "flat"
                  scroll-method "no-scroll"
          }

          trackpoint {
                  // off
                  // natural-scroll
                  // accel-speed 0.2
                  // accel-profile "flat"
                  // scroll-method "on-button-down"
                  // scroll-button 273
                  // middle-emulation
          }

          warp-mouse-to-focus

          focus-follows-mouse max-scroll-amount="50%"
  }
#+END_SRC

* Outputs
This section sets the monitor configurations. These are different across environments so there
has to be evaluation performed to determine which monitor configurations get exported to config.kdl.
I've chose emacs-lisp for this because I found the string manipulation to be a little simper than
python, although I'm sure most of it is a limitation in my knowledge.
#+NAME: lenovo-output-config
#+BEGIN_SRC emacs-lisp :eval yes
     (format "%s" "output \"HDMI-A-1\" {

               // off

               mode \"1920x1080@60\"

               scale 1
               transform \"normal\"

               position x=0 y=0
      }
    
      output \"HDMI-A-2\" {

             // off

             mode \"1920x1080@60\"

             scale 1
             transform \"normal\"

             position x=1920 y=0
      }
  
      output \"HDMI-A-3\" {

            // off

            mode \"1920x1080@60\"

            scale 1
            transform \"normal\"

            position x=3840 y=0
      }")  
#+END_SRC

#+RESULTS: lenovo-output-config
#+begin_example
output "HDMI-A-1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }

 output "HDMI-A-2" {

        // off

        mode "1920x1080@60"

        scale 1
        transform "normal"

        position x=1920 y=0
 }

 output "HDMI-A-3" {

       // off

       mode "1920x1080@60"

       scale 1
       transform "normal"

       position x=3840 y=0
 }
#+end_example

#+NAME: dell-output-config
#+BEGIN_SRC emacs-lisp :eval yes
     (format "%s" "output \"eDP1\" {

               // off

               mode \"1920x1080@60\"

               scale 1
               transform \"normal\"

               position x=0 y=0
      }")  
#+END_SRC

#+RESULTS: dell-output-config
#+begin_example
output "eDP1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }
#+end_example

#+NAME: pi-output-config
#+BEGIN_SRC emacs-lisp :eval yes
     (format "%s" "output \"HDMI-A-1\" {

               // off

               mode \"1920x1080@60\"

               scale 1
               transform \"normal\"

               position x=0 y=0
      }")  
#+END_SRC

#+RESULTS: pi-output-config
#+begin_example
output "HDMI-A-1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }
#+end_example

This generates the output section based on the target-system. After now knowing more about how
babel works, this can be done more elegantly and likely doe not need any if statements but just
variable matching logic.
#+NAME: output_config_eval
#+BEGIN_SRC python :eval yes :var loc=lenovo-output-config :var doc=dell-output-config :var poc=pi-output-config :var ts=target-system
  if ts=="lenovo":
      _config=loc
  elif ts=="dell":
      _config=doc
  elif ts=="pi":
      _config=poc
      
  return _config
#+END_SRC

#+RESULTS: output_config_eval
#+begin_example
output "HDMI-A-1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }

 output "HDMI-A-2" {

        // off

        mode "1920x1080@60"

        scale 1
        transform "normal"

        position x=1920 y=0
 }

 output "HDMI-A-3" {

       // off

       mode "1920x1080@60"

       scale 1
       transform "normal"

       position x=3840 y=0
 }
#+end_example

#+NAME: output_config
#+BEGIN_SRC kdl :noweb yes :tangle ./config.kdl
// ## OUTPUT CONFIGURATION ####################################################    
  <<output_config_eval()>>
#+END_SRC

* Startup Apps
These are the apps that startup when niri starts. This actually works better in my opinion just
putting all these in a single shell script and calling the shell script which enables
preprocessing and progamatic control to ensure they startup in the correct sequence etc.
#+BEGIN_SRC kdl :noweb yes :eval yes :tangle ./config.kdl
// ## STARTUP APPS  ###########################################################
      spawn-at-startup      <<xwayland()>>  
      spawn-at-startup      <<idle_lock()>>
      spawn-at-startup      <<setup_theme()>>
      spawn-at-startup      <<wallpaper()>>
      spawn-at-startup      <<notifications()>>
      spawn-at-startup      <<status_bar()>>
      spawn-at-startup      <<spotify()>>
      spawn-at-startup      <<element()>>
      spawn-at-startup      <<sms()>>
      spawn-at-startup      <<calendar()>>
      spawn-at-startup      <<discord()>>
#+END_SRC

* Workspaces
This where I setup my static workspaces. These are mostly used for my 3 monitor setup, where I have
a dedicated monitor for these workspaces. Similar to output there needs to evaluation to determine
the target system as this is different between my desktop and laptop.
#+NAME: lenovo-workspace-config
#+BEGIN_SRC emacs-lisp :eval yes
  (format "%s" "
  workspace \"scratchpad\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"spotify\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"discord\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"cameras\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"virtbox\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"element\" {
          open-on-output \"HDMI-A-3\"
  }

  workspace \"messaging\" {
          open-on-output \"HDMI-A-3\"
  }")  
#+END_SRC

#+RESULTS: lenovo-workspace-config
#+begin_example

workspace "scratchpad" {
        open-on-output "HDMI-A-3"
}

workspace "spotify" {
        open-on-output "HDMI-A-3"
}

workspace "discord" {
        open-on-output "HDMI-A-3"
}

workspace "cameras" {
        open-on-output "HDMI-A-3"
}

workspace "virtbox" {
        open-on-output "HDMI-A-3"
}

workspace "element" {
        open-on-output "HDMI-A-3"
}

workspace "messaging" {
        open-on-output "HDMI-A-3"
}
#+end_example

#+NAME: dell-workspace-config
#+BEGIN_SRC emacs-lisp :eval yes
  (format "%s" "
  workspace \"scratchpad\" {
  }

  workspace \"spotify\" {
  }

  workspace \"discord\" {
  }

  workspace \"element\" {
  }

  workspace \"messaging\" {
  }")  
#+END_SRC

#+RESULTS: dell-workspace-config
#+begin_example

workspace "scratchpad" {
}

workspace "spotify" {
}

workspace "discord" {
}

workspace "element" {
}

workspace "messaging" {
}
#+end_example

#+NAME: pi-workspace-config
#+BEGIN_SRC emacs-lisp :eval yes
  (format "%s" "
  workspace \"scratchpad\" {
  }

  workspace \"spotify\" {
  }

  workspace \"discord\" {
  }

  workspace \"element\" {
  }

  workspace \"messaging\" {
  }")  
#+END_SRC

#+RESULTS: pi-workspace-config
#+begin_example

workspace "scratchpad" {
}

workspace "spotify" {
}

workspace "discord" {
}

workspace "element" {
}

workspace "messaging" {
}
#+end_example

This section will determine which workspace configuration to output into config.kdl.
#+NAME: workspace_config_eval
#+BEGIN_SRC python :eval yes :var loc=lenovo-workspace-config :var doc=dell-workspace-config :var poc=pi-workspace-config :var ts=target-system
  if ts=="lenovo":
      _config=loc
  elif ts=="dell":
      _config=doc
  elif ts=="pi":
      _config=poc
      
  return _config
#+END_SRC

#+RESULTS: workspace_config_eval
#+begin_example

workspace "scratchpad" {
        open-on-output "HDMI-A-3"
}

workspace "spotify" {
        open-on-output "HDMI-A-3"
}

workspace "discord" {
        open-on-output "HDMI-A-3"
}

workspace "cameras" {
        open-on-output "HDMI-A-3"
}

workspace "virtbox" {
        open-on-output "HDMI-A-3"
}

workspace "element" {
        open-on-output "HDMI-A-3"
}

workspace "messaging" {
        open-on-output "HDMI-A-3"
}
#+end_example

#+BEGIN_SRC kdl :noweb yes :tangle ./config.kdl
// ## SETUP WORKSPACES ##################################################    
  <<workspace_config_eval()>>
#+END_SRC

* Other
Niri has some miscellaneous config options that I've placed in this section. I've created
my own hotkey overlay referenced later.
#+BEGIN_SRC kdl :tangle ./config.kdl
// ## MISCELLANEOUS ##########################################################  
  hotkey-overlay {
          skip-at-startup
  }
#+END_SRC

