niri_config.html
<div id="outline-container-orgc3adad1" class="outline-2">
<h2 id="orgc3adad1"><span class="section-number-2">8.</span> Inputs</h2>
<div class="outline-text-2" id="text-8">
<p>
This section defined inputs such as keyboard, mouse, pen etc. Focus follows mouse it
probably the most critical setting for my use so that when hovering a mouse over
a windows the focus also it set to the window being hovered. I have adopted this sam
behaviour in emacs since using tile managers.
</p>
</div>
</div>
<div id="outline-container-org2bac097" class="outline-2">
<h2 id="org2bac097"><span class="section-number-2">9.</span> Outputs</h2>
<div class="outline-text-2" id="text-9">
<p>
This section sets the monitor configurations. These are different across environments so there
has to be evaluation performed to determine which monitor configurations get exported to config.kdl.
I've chose emacs-lisp for this because I found the string manipulation to be a little simper than
python, although I'm sure most of it is a limitation in my knowledge.
</p>
<pre class="example" id="orgb043d4d">
output "HDMI-A-1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }

 output "HDMI-A-2" {

        // off

        mode "1920x1080@60"

        scale 1
        transform "normal"

        position x=1920 y=0
 }

 output "HDMI-A-3" {

       // off

       mode "1920x1080@60"

       scale 1
       transform "normal"

       position x=3840 y=0
 }
</pre>

<pre class="example" id="org0030ac4">
output "eDP1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }
</pre>

<p>
This generates the output section based on the target-system. After now knowing more about how
babel works, this can be done more elegantly and likely doe not need any if statements but just
variable matching logic.
</p>
<pre class="example" id="org2418a2f">
output "HDMI-A-1" {

          // off

          mode "1920x1080@60"

          scale 1
          transform "normal"

          position x=0 y=0
 }

 output "HDMI-A-2" {

        // off

        mode "1920x1080@60"

        scale 1
        transform "normal"

        position x=1920 y=0
 }

 output "HDMI-A-3" {

       // off

       mode "1920x1080@60"

       scale 1
       transform "normal"

       position x=3840 y=0
 }
</pre>
</div>
</div>
<div id="outline-container-org6f9f76b" class="outline-2">
<h2 id="org6f9f76b"><span class="section-number-2">10.</span> Startup Apps</h2>
<div class="outline-text-2" id="text-10">
<p>
These are the apps that startup when niri starts. This actually works better in my opinion just
putting all these in a single shell script and calling the shell script which enables
preprocessing and progamatic control to ensure they startup in the correct sequence etc.
</p>
</div>
</div>
<div id="outline-container-org3877c0c" class="outline-2">
<h2 id="org3877c0c"><span class="section-number-2">11.</span> Workspaces</h2>
<div class="outline-text-2" id="text-11">
<p>
This where I setup my static workspaces. These are mostly used for my 3 monitor setup, where I have
a dedicated monitor for these workspaces. Similar to output there needs to evaluation to determine
the target system as this is different between my desktop and laptop.
</p>
<pre class="example" id="orgf0f9b8f">

workspace "scratchpad" {
        open-on-output "HDMI-A-3"
}

workspace "spotify" {
        open-on-output "HDMI-A-3"
}

workspace "discord" {
        open-on-output "HDMI-A-3"
}

workspace "cameras" {
        open-on-output "HDMI-A-3"
}

workspace "virtbox" {
        open-on-output "HDMI-A-3"
}

workspace "element" {
        open-on-output "HDMI-A-3"
}

workspace "messaging" {
        open-on-output "HDMI-A-3"
}
</pre>

<pre class="example">

workspace "scratchpad" {
        open-on-output "eDP1"
}
</pre>


<p>
This section will determine which workspace configuration to output into config.kdl.
</p>
<pre class="example" id="orgd4ae848">

workspace "scratchpad" {
        open-on-output "HDMI-A-3"
}

workspace "spotify" {
        open-on-output "HDMI-A-3"
}

workspace "discord" {
        open-on-output "HDMI-A-3"
}

workspace "cameras" {
        open-on-output "HDMI-A-3"
}

workspace "virtbox" {
        open-on-output "HDMI-A-3"
}

workspace "element" {
        open-on-output "HDMI-A-3"
}

workspace "messaging" {
        open-on-output "HDMI-A-3"
}
</pre>
</div>
</div>
<div id="outline-container-org7e75c54" class="outline-2">
<h2 id="org7e75c54"><span class="section-number-2">12.</span> Other</h2>
<div class="outline-text-2" id="text-12">
<p>
Niri has some miscellaneous config options that I've placed in this section. I've created
my own hotkey overlay referenced later.
</p>
</div>
</div>
