niri_config.org
* Layout
This section defines the basic layout, decorations and animations. Since niri supports hot
loading a config, I've toyed with the idea of creating a popup based on this content that
will allow me to change it on the fly and save the configurations to reapply periodically.
So for example, you would hit key sequence which pops up a window of these values, alter
the values save the config and apply. This would allow for quick visual changes to fine tune
QOL.
#+BEGIN_SRC kdl :tangle ./config.kdl :noweb yes :eval no :results value
  // ## LAYOUT CONFIGURATION ####################################################  
      layout {
              gaps 4

              center-focused-column "never"
            
              always-center-single-column

              preset-column-widths {
                      proportion 0.33333
                      proportion 0.5
                      proportion 0.66667
                      proportion 0.9
                      proportion 1.0
              }

              // preset-window-heights { }

              // default-column-width { proportion 0.5; }

              default-column-width {}

              // draw-border-with-background

              background-color "transparent"

              focus-ring {
                      // off
                      width 2
                      // active-color "<<foreground()>>"
                      // inactive-color "<<background()>>"
                      // active-color "<<color4()>>"
                      // inactive-color "<<background()>>"
                      // active-gradient from="#80c8ff" to="#bbddff" angle=45
                      // inactive-gradient from="#505050" to="#808080" angle=45 relative-to="workspace-view"
              }


              border {
                      off
                      width 1
                      active-color "#ffc87f"
                      inactive-color "#505050"
                      urgent-color "#9b0000"
                      active-gradient from="#ffbb66" to="#ffc880" angle=45 relative-to="workspace-view"
                      inactive-gradient from="#505050" to="#808080" angle=45 relative-to="workspace-view"
              }
              
              shadow {
                      // on
                      draw-behind-window false
                      softness 30
                      spread 5
                      offset x=0 y=5
                      color "#00000080"
                      inactive-color "#00000060"
              }

              struts {
                      left 0
                      right 0
                      top 0
                      bottom 0
              }

              tab-indicator {
                      // off
                      hide-when-single-tab
                      place-within-column
                      gap 5
                      width 15
                      length total-proportion=1.0
                      position "top"
                      gaps-between-tabs 5
                      corner-radius 8
                      active-color "bf616a"
                      inactive-color "gray"
                      // active-gradient from="#80c8ff" to="#bbddff" angle=45
                      // inactive-gradient from="#505050" to="#808080" angle=45 relative-to="workspace-view"
              }

              insert-hint {
                      // off
                      color "#ffc87f80"
                      gradient from="#ffbb6680" to="#ffc88080" angle=45 relative-to="workspace-view"
              }
      }
      // ## COMPOSITOR / OTHER CONFIGURATION ########################################
      prefer-no-csd

      screenshot-path "<<screenshot_path()>>/<<screenshot_file()>>"

      // ## ANIMATIONS ##############################################################
      animations {
          // off

       workspace-switch {
                      spring damping-ratio=2.0 stiffness=1000 epsilon=0.0001
              }

              window-open {
                      duration-ms 250
                      curve "ease-out-cubic"
              }

              window-close {
                      duration-ms 250
                      curve "ease-out-quad"
              }

              horizontal-view-movement {
                      spring damping-ratio=2.0 stiffness=500 epsilon=0.0001
              }

              window-movement {
                      spring damping-ratio=2.0 stiffness=500 epsilon=0.0001
              }

              window-resize {
                      spring damping-ratio=2.0 stiffness=500 epsilon=0.0001
              }

              config-notification-open-close {
                      spring damping-ratio=0.6 stiffness=500 epsilon=0.001
              }

              screenshot-ui-open {
                      duration-ms 200
                      curve "ease-out-quad"
              }

              overview-open-close {
                      spring damping-ratio=2.0 stiffness=500 epsilon=0.0001
              }

      }

      cursor {
              xcursor-theme "Qogirr"
              xcursor-size 12
              hide-when-typing
              //hide-after-inactive-ms 1000
      }

      // ## OVERVIEW SETTINGS ############################################################
      overview {
      	// backdrop-color "#566870"
              zoom 0.625
              workspace-shadow {
      	 	off
      	}
      }
#+END_SRC

* Window Rules
This section defines the window rules for my windows. I mostly use this to set an app to
floating / size and to assign the app to a specific workspace.
#+BEGIN_SRC kdl :tangle ./config.kdl
  // ## WINDOW / LAYER RULES #####################################################  
      window-rule {
              default-column-width {}
              geometry-corner-radius 10
              clip-to-geometry true
              draw-border-with-background false
              opacity 0.60
      }

      window-rule {
              match is-active=true
              opacity 1.0
      }

      window-rule {
              match app-id="pluma"
              open-floating true
      }

      window-rule {
              match app-id="Sxiv"
              open-floating true
              open-fullscreen true
      }

      window-rule {
              match app-id="emacs"
              open-floating false
              open-maximized true
      }

      window-rule {
              match app-id="org.pwmt.zathura"
              open-floating true
              default-column-width { fixed 900; }
              default-window-height { fixed 900; }
      }

      window-rule {
              match app-id="qalculate-gtk"
              open-floating true
              default-column-width { fixed 400; }
              default-window-height { fixed 400; }
      }

      window-rule {
              match app-id="Alacritty"
              open-floating true
              default-column-width { fixed 900; }
              default-window-height { fixed 900; }
      }

      window-rule {
              match app-id="Spotify"
              match app-id="spotify"
              open-on-workspace "spotify"
              open-maximized true
      }

      window-rule {
              match app-id="vesktop"
              open-on-workspace "discord"
              open-maximized true
      }

      window-rule {
              match app-id="org.cctv-viewer.cctv-viewer"
              open-on-workspace "cameras"
              open-maximized true
              opacity 1.0
      }

      window-rule {
              match app-id="VirtualBox Manager"
              open-on-workspace "virtbox"
              open-maximized true
      }

      window-rule {
              match app-id="Element"
              open-on-workspace "element"
              open-maximized true
      }

      window-rule {
              match app-id="GoogleMessages"
              open-on-workspace "messaging"
              open-maximized true
      }

      window-rule {
              match app-id="org.kde.kdeconnect.sms"
              open-on-workspace "messaging"
              open-maximized true
      }

      window-rule {
              match app-id="org.gnome.Geary"
              open-on-workspace "messaging"
              open-maximized true
      }

      window-rule {
              match app-id="googlecalendardark-nativefier-e22938"
              open-on-workspace "messaging"
              open-maximized true
      }
    
      window-rule {
              match app-id="feh"
              open-floating true
              default-column-width { fixed 1200; }
              default-window-height { fixed 800; }
      }

      window-rule {
            match app-id="Tk"
            open-floating true
            default-column-width { fixed 1050; }
            default-window-height { fixed 325; }
      }

      layer-rule {
              place-within-backdrop true
      }
#+END_SRC

