niri_config.html
<div id="outline-container-orgc8ee916" class="outline-2">
<h2 id="orgc8ee916"><span class="section-number-2">13.</span> Layout</h2>
<div class="outline-text-2" id="text-13">
<p>
This section defines the basic layout, decorations and animations. Since niri supports hot
loading a config, I've toyed with the idea of creating a popup based on this content that
will allow me to change it on the fly and save the configurations to reapply periodically.
So for example, you would hit key sequence which pops up a window of these values, alter
the values save the config and apply. This would allow for quick visual changes to fine tune
QOL.
</p>
</div>
</div>
<div id="outline-container-org5bdf786" class="outline-2">
<h2 id="org5bdf786"><span class="section-number-2">14.</span> Window Rules</h2>
<div class="outline-text-2" id="text-14">
<p>
This section defines the window rules for my windows. I mostly use this to set an app to
floating / size and to assign the app to a specific workspace.
</p>
</div>
</div>
