niri_config.html
<div id="outline-container-orga6572e1" class="outline-2">
<h2 id="orga6572e1"><span class="section-number-2">15.</span> Bindings</h2>
<div class="outline-text-2" id="text-15">
<p>
This is the bindings data section. Each key binding is loaded into a python dict which contains
5 columns:
</p>

<ol class="org-ol">
<li>Keybinding - the key sequence (e.g. Mod+Shift+X).</li>
<li>Command - the command to invoke (.e.g. "floorp").</li>
<li>Spawn Y | N - if a spawn command needs to be prepended to the command.</li>
<li>Description - A description of the binding to be used for a custom hotkey overlay.</li>
<li>Target "" (all) | all (common) | lenovo | dell - The target system for the keybinding. If
the target is left blank it will generate all keybindings which is used for documenting
the overlay. If you pass a target system in like "lenovo" it will return the commond
bindings use across all systems plus the lenovo specific ones.</li>
</ol>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">Mod+Shift+Slash</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>bindings</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Niri Key Bindings</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+D</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>launcher</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Launcher</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+B</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>bluetooth</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Bluetooth</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+M</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>music</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Music</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+N</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>network</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Network</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+D</td>
<td class="org-left">"~/.config/niri/scripts/rofi<sub>showwindows</sub>"</td>
<td class="org-left">Y</td>
<td class="org-left">Show Active Windows</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+E</td>
<td class="org-left">"emacsclient" "-c" "-s" "emacs-prod"</td>
<td class="org-left">Y</td>
<td class="org-left">Emacs - Prod</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+E</td>
<td class="org-left">"emacsclient" "-c" "-s" "emacs-dev"</td>
<td class="org-left">Y</td>
<td class="org-left">Emacs - Dev</td>
<td class="org-left">lenovo</td>
</tr>

<tr>
<td class="org-left">Mod+T</td>
<td class="org-left">"thunar"</td>
<td class="org-left">Y</td>
<td class="org-left">File Manager - GUI</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Y</td>
<td class="org-left">"sh" "-c" "kitty &#x2013;detach yazi"</td>
<td class="org-left">Y</td>
<td class="org-left">File Manager - Term</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+N</td>
<td class="org-left">"pluma"</td>
<td class="org-left">Y</td>
<td class="org-left">Notes</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+1</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"</td>
<td class="org-left">Y</td>
<td class="org-left">SMS Get</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+1</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"</td>
<td class="org-left">Y</td>
<td class="org-left">SMS Put</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+2</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"</td>
<td class="org-left">Y</td>
<td class="org-left">Email Get</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+2</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"</td>
<td class="org-left">Y</td>
<td class="org-left">Email Put</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+P</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "put" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"</td>
<td class="org-left">Y</td>
<td class="org-left">Scratchpad Put</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+P</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "get" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"</td>
<td class="org-left">Y</td>
<td class="org-left">Scratchpad Get</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Return</td>
<td class="org-left">"~/.config/niri/scripts/alacritty"</td>
<td class="org-left">Y</td>
<td class="org-left">Terminal</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Alt+L</td>
<td class="org-left">"~/.config/niri/scripts/lockscreen"</td>
<td class="org-left">Y</td>
<td class="org-left">Lock Screen</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">XF86AudioRaiseVolume allow-when-locked=true</td>
<td class="org-left">"wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1+"</td>
<td class="org-left">Y</td>
<td class="org-left">Vol+</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">XF86AudioLowerVolume allow-when-locked=true</td>
<td class="org-left">"wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1-"</td>
<td class="org-left">Y</td>
<td class="org-left">Vol-</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">XF86AudioMute allow-when-locked=true</td>
<td class="org-left">"wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "toggle"</td>
<td class="org-left">Y</td>
<td class="org-left">Mute</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">XF86AudioMicMute allow-when-locked=true</td>
<td class="org-left">"wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SOURCE</sub>@" "toggle"</td>
<td class="org-left">Y</td>
<td class="org-left">Mic Mute</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+S</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker"</td>
<td class="org-left">Y</td>
<td class="org-left">Screenshot Picker</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+S</td>
<td class="org-left">"~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker-emacs"</td>
<td class="org-left">Y</td>
<td class="org-left">Screenshot Picker - Emacs</td>
<td class="org-left">lenovo</td>
</tr>

<tr>
<td class="org-left">Mod+S</td>
<td class="org-left">screenshot</td>
<td class="org-left">N</td>
<td class="org-left">Screenshot</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+O repeat=false</td>
<td class="org-left">toggle-overview</td>
<td class="org-left">N</td>
<td class="org-left">Toggle Overview</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Q</td>
<td class="org-left">close-window</td>
<td class="org-left">N</td>
<td class="org-left">Close Window</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+h</td>
<td class="org-left">focus-column-left</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+j</td>
<td class="org-left">focus-window-down</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+k</td>
<td class="org-left">focus-window-up</td>
<td class="org-left">N</td>
<td class="org-left">Focus Window Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+l</td>
<td class="org-left">focus-column-right</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+h</td>
<td class="org-left">move-column-left</td>
<td class="org-left">N</td>
<td class="org-left">Move Column Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+j</td>
<td class="org-left">move-window-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Window Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+k</td>
<td class="org-left">move-window-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Window Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+l</td>
<td class="org-left">move-column-right</td>
<td class="org-left">N</td>
<td class="org-left">Move Column Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Home</td>
<td class="org-left">focus-column-first</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column First</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+End</td>
<td class="org-left">focus-column-last</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Last</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Home</td>
<td class="org-left">move-column-to-first</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To First</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+End</td>
<td class="org-left">move-column-to-last</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Last</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+h</td>
<td class="org-left">focus-monitor-left</td>
<td class="org-left">N</td>
<td class="org-left">Focus Monitor Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+j</td>
<td class="org-left">focus-monitor-down</td>
<td class="org-left">N</td>
<td class="org-left">Focus Monitor Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+k</td>
<td class="org-left">focus-monitor-up</td>
<td class="org-left">N</td>
<td class="org-left">Focus Monitor Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+l</td>
<td class="org-left">focus-monitor-right</td>
<td class="org-left">N</td>
<td class="org-left">Focus Monitor Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+h</td>
<td class="org-left">move-column-to-monitor-left</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Monitor Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+j</td>
<td class="org-left">move-column-to-monitor-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Monitor Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+k</td>
<td class="org-left">move-column-to-monitor-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Monitor Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+l</td>
<td class="org-left">move-column-to-monitor-right</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Monitor Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Page<sub>Down</sub></td>
<td class="org-left">focus-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Page<sub>Up</sub></td>
<td class="org-left">focus-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+U</td>
<td class="org-left">focus-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+I</td>
<td class="org-left">focus-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Page<sub>Down</sub></td>
<td class="org-left">move-column-to-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Page<sub>Up</sub></td>
<td class="org-left">move-column-to-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+U</td>
<td class="org-left">move-column-to-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+I</td>
<td class="org-left">move-column-to-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Page<sub>Down</sub></td>
<td class="org-left">move-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Page<sub>Up</sub></td>
<td class="org-left">move-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+U</td>
<td class="org-left">move-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+I</td>
<td class="org-left">move-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+WheelScrollDown cooldown-ms=150</td>
<td class="org-left">focus-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+WheelScrollUp cooldown-ms=150</td>
<td class="org-left">focus-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+WheelScrollDown cooldown-ms=150</td>
<td class="org-left">move-column-to-workspace-down</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Down</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+WheelScrollUp cooldown-ms=150</td>
<td class="org-left">move-column-to-workspace-up</td>
<td class="org-left">N</td>
<td class="org-left">Move Column To Workspace Up</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+WheelScrollDown</td>
<td class="org-left">focus-column-right</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+WheelScrollUp</td>
<td class="org-left">focus-column-left</td>
<td class="org-left">N</td>
<td class="org-left">Focus Column Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Shift+WheelScrollDown</td>
<td class="org-left">move-column-right</td>
<td class="org-left">N</td>
<td class="org-left">Move Column Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Shift+WheelScrollUp</td>
<td class="org-left">move-column-left</td>
<td class="org-left">N</td>
<td class="org-left">Move Column Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Tab</td>
<td class="org-left">focus-workspace-previous</td>
<td class="org-left">N</td>
<td class="org-left">Focus Workspace Previous</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+BracketLeft</td>
<td class="org-left">consume-or-expel-window-left</td>
<td class="org-left">N</td>
<td class="org-left">Consume Or Expel Window Left</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+BracketRight</td>
<td class="org-left">consume-or-expel-window-right</td>
<td class="org-left">N</td>
<td class="org-left">Consume Or Expel Window Right</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Comma</td>
<td class="org-left">consume-window-into-column</td>
<td class="org-left">N</td>
<td class="org-left">Consume Window Into Column</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Period</td>
<td class="org-left">expel-window-from-column</td>
<td class="org-left">N</td>
<td class="org-left">Expel Window From Column</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+R</td>
<td class="org-left">switch-preset-column-width</td>
<td class="org-left">N</td>
<td class="org-left">Switch Preset Column Width</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+R</td>
<td class="org-left">switch-preset-window-height</td>
<td class="org-left">N</td>
<td class="org-left">Switch Preset Column Height</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+R</td>
<td class="org-left">reset-window-height</td>
<td class="org-left">N</td>
<td class="org-left">Reset Window Height</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+F</td>
<td class="org-left">maximize-column</td>
<td class="org-left">N</td>
<td class="org-left">Maximize Column</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+F</td>
<td class="org-left">fullscreen-window</td>
<td class="org-left">N</td>
<td class="org-left">Fullscreen Window</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+F</td>
<td class="org-left">expand-column-to-available-width</td>
<td class="org-left">N</td>
<td class="org-left">Expand Column To Available Width</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+C</td>
<td class="org-left">center-column</td>
<td class="org-left">N</td>
<td class="org-left">Center Column</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+C</td>
<td class="org-left">center-visible-columns</td>
<td class="org-left">N</td>
<td class="org-left">Center Visible Columns</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Minus</td>
<td class="org-left">set-column-width "-10%"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width -10%</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Equal</td>
<td class="org-left">set-column-width "+10%"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width +10%</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Minus</td>
<td class="org-left">set-column-width "-1"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width -1</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+Equal</td>
<td class="org-left">set-column-width "+1"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width +1</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Minus</td>
<td class="org-left">set-window-height "-10%"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height -10%</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Equal</td>
<td class="org-left">set-window-height "+10%"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height +10%</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+Minus</td>
<td class="org-left">set-window-height "-1"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height -1</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+Equal</td>
<td class="org-left">set-window-height "+1"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height +1</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+0</td>
<td class="org-left">set-column-width "960"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+0</td>
<td class="org-left">set-window-height "540"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height 540</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Alt+0</td>
<td class="org-left">set-column-width "1280"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width 1280</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Alt+0</td>
<td class="org-left">set-window-height "720"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height 720</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Ctrl+0</td>
<td class="org-left">set-column-width "1920"</td>
<td class="org-left">N</td>
<td class="org-left">Set Column Width 1920</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Ctrl+0</td>
<td class="org-left">set-window-height "1080"</td>
<td class="org-left">N</td>
<td class="org-left">Set Window Height 1080</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+V</td>
<td class="org-left">toggle-window-floating</td>
<td class="org-left">N</td>
<td class="org-left">Toggle Window Floating</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+V</td>
<td class="org-left">switch-focus-between-floating-and-tiling</td>
<td class="org-left">N</td>
<td class="org-left">Switch Focus Floating And Tiling</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+W</td>
<td class="org-left">toggle-column-tabbed-display</td>
<td class="org-left">N</td>
<td class="org-left">Toggle Column Tabbed Display</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Space</td>
<td class="org-left">switch-layout "next"</td>
<td class="org-left">N</td>
<td class="org-left">Switch Layout - Next</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Shift+Space</td>
<td class="org-left">switch-layout "prev"</td>
<td class="org-left">N</td>
<td class="org-left">Switch Layout - Prev</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Print</td>
<td class="org-left">screenshot</td>
<td class="org-left">N</td>
<td class="org-left">Screenshot</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Ctrl+Print</td>
<td class="org-left">screenshot-screen</td>
<td class="org-left">N</td>
<td class="org-left">Screenshot Sreen</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Alt+Print</td>
<td class="org-left">screenshot-window</td>
<td class="org-left">N</td>
<td class="org-left">Screenshot Window</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Mod+Escape allow-inhibiting=false</td>
<td class="org-left">toggle-keyboard-shortcuts-inhibit</td>
<td class="org-left">N</td>
<td class="org-left">Toggle Keyboard Shortcuts - Inhibit</td>
<td class="org-left">all</td>
</tr>

<tr>
<td class="org-left">Ctrl+Alt+Delete</td>
<td class="org-left">quit</td>
<td class="org-left">N</td>
<td class="org-left">Quit</td>
<td class="org-left">all</td>
</tr>
</tbody>
</table>

<p>
This is the keybindings-config code block which returns the keybindings base on the
target system. There is mode option which will return the keybinding content to
be used for configuration use or doc use.
</p>
<p>
Mod+Shift+Slash                                    { spawn "~/.config/niri/scripts/rofi<sub>bindings</sub>"; }
Mod+D                                              { spawn "~/.config/niri/scripts/rofi<sub>launcher</sub>"; }
Mod+B                                              { spawn "~/.config/niri/scripts/rofi<sub>bluetooth</sub>"; }
Mod+M                                              { spawn "~/.config/niri/scripts/rofi<sub>music</sub>"; }
Mod+N                                              { spawn "~/.config/niri/scripts/rofi<sub>network</sub>"; }
Mod+Shift+D                                        { spawn "~/.config/niri/scripts/rofi<sub>showwindows</sub>"; }
Mod+E                                              { spawn "emacsclient" "-c" "-s" "emacs-prod"; }
Mod+Shift+E                                        { spawn "emacsclient" "-c" "-s" "emacs-dev"; }
Mod+T                                              { spawn "thunar"; }
Mod+Shift+Y                                        { spawn "sh" "-c" "kitty &#x2013;detach yazi"; }
Mod+Shift+N                                        { spawn "pluma"; }
Mod+1                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+1                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+2                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+2                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+P                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "put" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Shift+P                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "get" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Return                                         { spawn "~/.config/niri/scripts/alacritty"; }
Mod+Alt+L                                          { spawn "~/.config/niri/scripts/lockscreen"; }
XF86AudioRaiseVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1+"; }
XF86AudioLowerVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1-"; }
XF86AudioMute allow-when-locked=true               { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "toggle"; }
XF86AudioMicMute allow-when-locked=true            { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SOURCE</sub>@" "toggle"; }
Mod+Shift+S                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker"; }
Mod+Ctrl+S                                         { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker-emacs"; }
Mod+S                                              { screenshot; }
Mod+O repeat=false                                 { toggle-overview; }
Mod+Q                                              { close-window; }
Mod+h                                              { focus-column-left; }
Mod+j                                              { focus-window-down; }
Mod+k                                              { focus-window-up; }
Mod+l                                              { focus-column-right; }
Mod+Shift+h                                        { move-column-left; }
Mod+Shift+j                                        { move-window-down; }
Mod+Shift+k                                        { move-window-up; }
Mod+Shift+l                                        { move-column-right; }
Mod+Home                                           { focus-column-first; }
Mod+End                                            { focus-column-last; }
Mod+Ctrl+Home                                      { move-column-to-first; }
Mod+Ctrl+End                                       { move-column-to-last; }
Mod+Ctrl+h                                         { focus-monitor-left; }
Mod+Ctrl+j                                         { focus-monitor-down; }
Mod+Ctrl+k                                         { focus-monitor-up; }
Mod+Ctrl+l                                         { focus-monitor-right; }
Mod+Shift+Ctrl+h                                   { move-column-to-monitor-left; }
Mod+Shift+Ctrl+j                                   { move-column-to-monitor-down; }
Mod+Shift+Ctrl+k                                   { move-column-to-monitor-up; }
Mod+Shift+Ctrl+l                                   { move-column-to-monitor-right; }
Mod+Page<sub>Down</sub>                                      { focus-workspace-down; }
Mod+Page<sub>Up</sub>                                        { focus-workspace-up; }
Mod+U                                              { focus-workspace-down; }
Mod+I                                              { focus-workspace-up; }
Mod+Ctrl+Page<sub>Down</sub>                                 { move-column-to-workspace-down; }
Mod+Ctrl+Page<sub>Up</sub>                                   { move-column-to-workspace-up; }
Mod+Ctrl+U                                         { move-column-to-workspace-down; }
Mod+Ctrl+I                                         { move-column-to-workspace-up; }
Mod+Shift+Page<sub>Down</sub>                                { move-workspace-down; }
Mod+Shift+Page<sub>Up</sub>                                  { move-workspace-up; }
Mod+Shift+U                                        { move-workspace-down; }
Mod+Shift+I                                        { move-workspace-up; }
Mod+WheelScrollDown cooldown-ms=150                { focus-workspace-down; }
Mod+WheelScrollUp cooldown-ms=150                  { focus-workspace-up; }
Mod+Ctrl+WheelScrollDown cooldown-ms=150           { move-column-to-workspace-down; }
Mod+Ctrl+WheelScrollUp cooldown-ms=150             { move-column-to-workspace-up; }
Mod+Shift+WheelScrollDown                          { focus-column-right; }
Mod+Shift+WheelScrollUp                            { focus-column-left; }
Mod+Ctrl+Shift+WheelScrollDown                     { move-column-right; }
Mod+Ctrl+Shift+WheelScrollUp                       { move-column-left; }
Mod+Tab                                            { focus-workspace-previous; }
Mod+BracketLeft                                    { consume-or-expel-window-left; }
Mod+BracketRight                                   { consume-or-expel-window-right; }
Mod+Comma                                          { consume-window-into-column; }
Mod+Period                                         { expel-window-from-column; }
Mod+R                                              { switch-preset-column-width; }
Mod+Shift+R                                        { switch-preset-window-height; }
Mod+Ctrl+R                                         { reset-window-height; }
Mod+F                                              { maximize-column; }
Mod+Shift+F                                        { fullscreen-window; }
Mod+Ctrl+F                                         { expand-column-to-available-width; }
Mod+C                                              { center-column; }
Mod+Ctrl+C                                         { center-visible-columns; }
Mod+Minus                                          { set-column-width "-10%"; }
Mod+Equal                                          { set-column-width "<del>10%"; }
Mod+Ctrl+Minus                                     { set-column-width "-1"; }
Mod+Ctrl+Equal                                     { set-column-width "+1"; }
Mod+Shift+Minus                                    { set-window-height "-10%"; }
Mod+Shift+Equal                                    { set-window-height "+10%"; }
Mod+Shift+Ctrl+Minus                               { set-window-height "-1"; }
Mod+Shift+Ctrl+Equal                               { set-window-height "+1"; }
Mod+0                                              { set-column-width "960"; }
Mod+Shift+0                                        { set-window-height "540"; }
Mod+Alt+0                                          { set-column-width "1280"; }
Mod+Shift+Alt+0                                    { set-window-height "720"; }
Mod+Ctrl+0                                         { set-column-width "1920"; }
Mod+Shift+Ctrl+0                                   { set-window-height "1080"; }
Mod+V                                              { toggle-window-floating; }
Mod+Shift+V                                        { switch-focus-between-floating-and-tiling; }
Mod+W                                              { toggle-column-tabbed-display; }
Mod+Space                                          { switch-layout "next"; }
Mod+Shift+Space                                    { switch-layout "prev"; }
Print                                              { screenshot; }
Ctrl+Print                                         { screenshot-screen; }
Alt+Print                                          { screenshot-window; }
Mod+Escape allow-inhibiting=false                  { toggle-keyboard-shortcuts-inhibit; }
Ctrl+Alt+Delete                                    { quit; }
Mod+Shift+Slash                                    { spawn "~/.config/niri/scripts/rofi<sub>bindings</sub>"; }
Mod+D                                              { spawn "~/.config/niri/scripts/rofi<sub>launcher</sub>"; }
Mod+B                                              { spawn "~/.config/niri/scripts/rofi<sub>bluetooth</sub>"; }
Mod+M                                              { spawn "~/.config/niri/scripts/rofi<sub>music</sub>"; }
Mod+N                                              { spawn "~/.config/niri/scripts/rofi<sub>network</sub>"; }
Mod+Shift+D                                        { spawn "~/.config/niri/scripts/rofi<sub>showwindows</sub>"; }
Mod+E                                              { spawn "emacsclient" "-c" "-s" "emacs-prod"; }
Mod+Shift+E                                        { spawn "emacsclient" "-c" "-s" "emacs-dev"; }
Mod+T                                              { spawn "thunar"; }
Mod+Shift+Y                                        { spawn "sh" "-c" "kitty &#x2013;detach yazi"; }
Mod+Shift+N                                        { spawn "pluma"; }
Mod+1                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+1                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+2                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+2                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+P                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "put" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Shift+P                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "get" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Return                                         { spawn "~/.config/niri/scripts/alacritty"; }
Mod+Alt+L                                          { spawn "~/.config/niri/scripts/lockscreen"; }
XF86AudioRaiseVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1</del>"; }
XF86AudioLowerVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1-"; }
XF86AudioMute allow-when-locked=true               { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "toggle"; }
XF86AudioMicMute allow-when-locked=true            { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SOURCE</sub>@" "toggle"; }
Mod+Shift+S                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker"; }
Mod+Ctrl+S                                         { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker-emacs"; }
Mod+S                                              { screenshot; }
Mod+O repeat=false                                 { toggle-overview; }
Mod+Q                                              { close-window; }
Mod+h                                              { focus-column-left; }
Mod+j                                              { focus-window-down; }
Mod+k                                              { focus-window-up; }
Mod+l                                              { focus-column-right; }
Mod+Shift+h                                        { move-column-left; }
Mod+Shift+j                                        { move-window-down; }
Mod+Shift+k                                        { move-window-up; }
Mod+Shift+l                                        { move-column-right; }
Mod+Home                                           { focus-column-first; }
Mod+End                                            { focus-column-last; }
Mod+Ctrl+Home                                      { move-column-to-first; }
Mod+Ctrl+End                                       { move-column-to-last; }
Mod+Ctrl+h                                         { focus-monitor-left; }
Mod+Ctrl+j                                         { focus-monitor-down; }
Mod+Ctrl+k                                         { focus-monitor-up; }
Mod+Ctrl+l                                         { focus-monitor-right; }
Mod+Shift+Ctrl+h                                   { move-column-to-monitor-left; }
Mod+Shift+Ctrl+j                                   { move-column-to-monitor-down; }
Mod+Shift+Ctrl+k                                   { move-column-to-monitor-up; }
Mod+Shift+Ctrl+l                                   { move-column-to-monitor-right; }
Mod+Page<sub>Down</sub>                                      { focus-workspace-down; }
Mod+Page<sub>Up</sub>                                        { focus-workspace-up; }
Mod+U                                              { focus-workspace-down; }
Mod+I                                              { focus-workspace-up; }
Mod+Ctrl+Page<sub>Down</sub>                                 { move-column-to-workspace-down; }
Mod+Ctrl+Page<sub>Up</sub>                                   { move-column-to-workspace-up; }
Mod+Ctrl+U                                         { move-column-to-workspace-down; }
Mod+Ctrl+I                                         { move-column-to-workspace-up; }
Mod+Shift+Page<sub>Down</sub>                                { move-workspace-down; }
Mod+Shift+Page<sub>Up</sub>                                  { move-workspace-up; }
Mod+Shift+U                                        { move-workspace-down; }
Mod+Shift+I                                        { move-workspace-up; }
Mod+WheelScrollDown cooldown-ms=150                { focus-workspace-down; }
Mod+WheelScrollUp cooldown-ms=150                  { focus-workspace-up; }
Mod+Ctrl+WheelScrollDown cooldown-ms=150           { move-column-to-workspace-down; }
Mod+Ctrl+WheelScrollUp cooldown-ms=150             { move-column-to-workspace-up; }
Mod+Shift+WheelScrollDown                          { focus-column-right; }
Mod+Shift+WheelScrollUp                            { focus-column-left; }
Mod+Ctrl+Shift+WheelScrollDown                     { move-column-right; }
Mod+Ctrl+Shift+WheelScrollUp                       { move-column-left; }
Mod+Tab                                            { focus-workspace-previous; }
Mod+BracketLeft                                    { consume-or-expel-window-left; }
Mod+BracketRight                                   { consume-or-expel-window-right; }
Mod+Comma                                          { consume-window-into-column; }
Mod+Period                                         { expel-window-from-column; }
Mod+R                                              { switch-preset-column-width; }
Mod+Shift+R                                        { switch-preset-window-height; }
Mod+Ctrl+R                                         { reset-window-height; }
Mod+F                                              { maximize-column; }
Mod+Shift+F                                        { fullscreen-window; }
Mod+Ctrl+F                                         { expand-column-to-available-width; }
Mod+C                                              { center-column; }
Mod+Ctrl+C                                         { center-visible-columns; }
Mod+Minus                                          { set-column-width "-10%"; }
Mod+Equal                                          { set-column-width "<del>10%"; }
Mod+Ctrl+Minus                                     { set-column-width "-1"; }
Mod+Ctrl+Equal                                     { set-column-width "+1"; }
Mod+Shift+Minus                                    { set-window-height "-10%"; }
Mod+Shift+Equal                                    { set-window-height "+10%"; }
Mod+Shift+Ctrl+Minus                               { set-window-height "-1"; }
Mod+Shift+Ctrl+Equal                               { set-window-height "+1"; }
Mod+0                                              { set-column-width "960"; }
Mod+Shift+0                                        { set-window-height "540"; }
Mod+Alt+0                                          { set-column-width "1280"; }
Mod+Shift+Alt+0                                    { set-window-height "720"; }
Mod+Ctrl+0                                         { set-column-width "1920"; }
Mod+Shift+Ctrl+0                                   { set-window-height "1080"; }
Mod+V                                              { toggle-window-floating; }
Mod+Shift+V                                        { switch-focus-between-floating-and-tiling; }
Mod+W                                              { toggle-column-tabbed-display; }
Mod+Space                                          { switch-layout "next"; }
Mod+Shift+Space                                    { switch-layout "prev"; }
Print                                              { screenshot; }
Ctrl+Print                                         { screenshot-screen; }
Alt+Print                                          { screenshot-window; }
Mod+Escape allow-inhibiting=false                  { toggle-keyboard-shortcuts-inhibit; }
Ctrl+Alt+Delete                                    { quit; }
Mod+Shift+Slash                                    { spawn "~/.config/niri/scripts/rofi<sub>bindings</sub>"; }
Mod+D                                              { spawn "~/.config/niri/scripts/rofi<sub>launcher</sub>"; }
Mod+B                                              { spawn "~/.config/niri/scripts/rofi<sub>bluetooth</sub>"; }
Mod+M                                              { spawn "~/.config/niri/scripts/rofi<sub>music</sub>"; }
Mod+N                                              { spawn "~/.config/niri/scripts/rofi<sub>network</sub>"; }
Mod+Shift+D                                        { spawn "~/.config/niri/scripts/rofi<sub>showwindows</sub>"; }
Mod+E                                              { spawn "emacsclient" "-c" "-s" "emacs-prod"; }
Mod+Shift+E                                        { spawn "emacsclient" "-c" "-s" "emacs-dev"; }
Mod+T                                              { spawn "thunar"; }
Mod+Shift+Y                                        { spawn "sh" "-c" "kitty &#x2013;detach yazi"; }
Mod+Shift+N                                        { spawn "pluma"; }
Mod+1                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+1                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "Messages" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+2                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "m" "&#x2013;target<sub>id</sub>" "HDMI-A-2" "&#x2013;focus"; }
Mod+Shift+2                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-move-window.py" "&#x2013;match" "mu4e" "&#x2013;target" "w" "&#x2013;target<sub>id</sub>" "messaging"; }
Mod+P                                              { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "put" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Shift+P                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri<sub>scratchpad</sub>" "&#x2013;action" "get" "&#x2013;scratchpad<sub>name</sub>" "scratchpad"; }
Mod+Return                                         { spawn "~/.config/niri/scripts/alacritty"; }
Mod+Alt+L                                          { spawn "~/.config/niri/scripts/lockscreen"; }
XF86AudioRaiseVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1</del>"; }
XF86AudioLowerVolume allow-when-locked=true        { spawn "wpctl" "set-volume" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "0.1-"; }
XF86AudioMute allow-when-locked=true               { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SINK</sub>@" "toggle"; }
XF86AudioMicMute allow-when-locked=true            { spawn "wpctl" "set-mute" "@DEFAULT<sub>AUDIO</sub><sub>SOURCE</sub>@" "toggle"; }
Mod+Shift+S                                        { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker"; }
Mod+Ctrl+S                                         { spawn "~/projects/niri<sub>toolkit</sub>/niri-screenshot-picker-emacs"; }
Mod+S                                              { screenshot; }
Mod+O repeat=false                                 { toggle-overview; }
Mod+Q                                              { close-window; }
Mod+h                                              { focus-column-left; }
Mod+j                                              { focus-window-down; }
Mod+k                                              { focus-window-up; }
Mod+l                                              { focus-column-right; }
Mod+Shift+h                                        { move-column-left; }
Mod+Shift+j                                        { move-window-down; }
Mod+Shift+k                                        { move-window-up; }
Mod+Shift+l                                        { move-column-right; }
Mod+Home                                           { focus-column-first; }
Mod+End                                            { focus-column-last; }
Mod+Ctrl+Home                                      { move-column-to-first; }
Mod+Ctrl+End                                       { move-column-to-last; }
Mod+Ctrl+h                                         { focus-monitor-left; }
Mod+Ctrl+j                                         { focus-monitor-down; }
Mod+Ctrl+k                                         { focus-monitor-up; }
Mod+Ctrl+l                                         { focus-monitor-right; }
Mod+Shift+Ctrl+h                                   { move-column-to-monitor-left; }
Mod+Shift+Ctrl+j                                   { move-column-to-monitor-down; }
Mod+Shift+Ctrl+k                                   { move-column-to-monitor-up; }
Mod+Shift+Ctrl+l                                   { move-column-to-monitor-right; }
Mod+Page<sub>Down</sub>                                      { focus-workspace-down; }
Mod+Page<sub>Up</sub>                                        { focus-workspace-up; }
Mod+U                                              { focus-workspace-down; }
Mod+I                                              { focus-workspace-up; }
Mod+Ctrl+Page<sub>Down</sub>                                 { move-column-to-workspace-down; }
Mod+Ctrl+Page<sub>Up</sub>                                   { move-column-to-workspace-up; }
Mod+Ctrl+U                                         { move-column-to-workspace-down; }
Mod+Ctrl+I                                         { move-column-to-workspace-up; }
Mod+Shift+Page<sub>Down</sub>                                { move-workspace-down; }
Mod+Shift+Page<sub>Up</sub>                                  { move-workspace-up; }
Mod+Shift+U                                        { move-workspace-down; }
Mod+Shift+I                                        { move-workspace-up; }
Mod+WheelScrollDown cooldown-ms=150                { focus-workspace-down; }
Mod+WheelScrollUp cooldown-ms=150                  { focus-workspace-up; }
Mod+Ctrl+WheelScrollDown cooldown-ms=150           { move-column-to-workspace-down; }
Mod+Ctrl+WheelScrollUp cooldown-ms=150             { move-column-to-workspace-up; }
Mod+Shift+WheelScrollDown                          { focus-column-right; }
Mod+Shift+WheelScrollUp                            { focus-column-left; }
Mod+Ctrl+Shift+WheelScrollDown                     { move-column-right; }
Mod+Ctrl+Shift+WheelScrollUp                       { move-column-left; }
Mod+Tab                                            { focus-workspace-previous; }
Mod+BracketLeft                                    { consume-or-expel-window-left; }
Mod+BracketRight                                   { consume-or-expel-window-right; }
Mod+Comma                                          { consume-window-into-column; }
Mod+Period                                         { expel-window-from-column; }
Mod+R                                              { switch-preset-column-width; }
Mod+Shift+R                                        { switch-preset-window-height; }
Mod+Ctrl+R                                         { reset-window-height; }
Mod+F                                              { maximize-column; }
Mod+Shift+F                                        { fullscreen-window; }
Mod+Ctrl+F                                         { expand-column-to-available-width; }
Mod+C                                              { center-column; }
Mod+Ctrl+C                                         { center-visible-columns; }
Mod+Minus                                          { set-column-width "-10%"; }
Mod+Equal                                          { set-column-width "+10%"; }
Mod+Ctrl+Minus                                     { set-column-width "-1"; }
Mod+Ctrl+Equal                                     { set-column-width "+1"; }
Mod+Shift+Minus                                    { set-window-height "-10%"; }
Mod+Shift+Equal                                    { set-window-height "+10%"; }
Mod+Shift+Ctrl+Minus                               { set-window-height "-1"; }
Mod+Shift+Ctrl+Equal                               { set-window-height "+1"; }
Mod+0                                              { set-column-width "960"; }
Mod+Shift+0                                        { set-window-height "540"; }
Mod+Alt+0                                          { set-column-width "1280"; }
Mod+Shift+Alt+0                                    { set-window-height "720"; }
Mod+Ctrl+0                                         { set-column-width "1920"; }
Mod+Shift+Ctrl+0                                   { set-window-height "1080"; }
Mod+V                                              { toggle-window-floating; }
Mod+Shift+V                                        { switch-focus-between-floating-and-tiling; }
Mod+W                                              { toggle-column-tabbed-display; }
Mod+Space                                          { switch-layout "next"; }
Mod+Shift+Space                                    { switch-layout "prev"; }
Print                                              { screenshot; }
Ctrl+Print                                         { screenshot-screen; }
Alt+Print                                          { screenshot-window; }
Mod+Escape allow-inhibiting=false                  { toggle-keyboard-shortcuts-inhibit; }
Ctrl+Alt+Delete                                    { quit; }
</p>

<p>
This generates the keybindings and outputs them to the config.kdl file.
This generates the keybindings documentation and writes it to a text file that is
referenced by a custom overlay displayed using a keybinding + rofi.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mike Burns</p>
<p class="date">Created: 2025-08-06 Wed 13:08</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
